In [1]:
# Imports
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame([[1, 2, 3],
                   [4, 5, 6],
                   [7, 8, 9],
                   [np.nan, np.nan, np.nan]],
                  columns=['A', 'B', 'C'])

In [3]:
df

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  9.0
3  NaN  NaN  NaN

In [4]:
df / df.sum(axis=0)

          A         B         C
0  0.083333  0.133333  0.166667
1  0.333333  0.333333  0.333333
2  0.583333  0.533333  0.500000
3       NaN       NaN       NaN

In [8]:
df['A'].mean()

4.0

In [9]:
df_dict = {'CL':[39.5,40.3,36.7,39.3], 'CD':[17.4,18,19.3,20.6], 'FL':[186,195,193,190],'BM':[3800,3250,3450,3650],'D15':[8.949,8.368,7.8766,8.665],'D13':[-24.7,-25.3,-25.3,-25.3], 'S':['A','A','C','G']}
df = pd.DataFrame(df_dict)
df

     CL    CD   FL    BM     D15   D13  S
0  39.5  17.4  186  3800  8.9490 -24.7  A
1  40.3  18.0  195  3250  8.3680 -25.3  A
2  36.7  19.3  193  3450  7.8766 -25.3  A
3  39.3  20.6  190  3650  8.6650 -25.3  A

In [12]:
df.groupby('S').aggregate([np.mean, np.median]).columns.shape[0]

12

In [13]:
df['S'].nunique()

1